/* No comment provided by engineer. */
"A new beta version of File Juicer is available" = "Er is een nieuwe bètaversie van File Juicer beschikbaar";

/* No comment provided by engineer. */
"A new version of File Juicer is available" = "Er is een nieuwe versie van File Juicer beschikbaar";

/* No comment provided by engineer. */
"Cancel" = "Annuleer";

/* As in choose folder */
"Choose" = "Kies";

/* No comment provided by engineer. */
"Choose Folder" = "Kies map";

/* No comment provided by engineer. */
"Could not save a found file. Check for disk space, and where the file is set to be saved in the preferences" = "Een bestand kon niet bewaard worden. Controleer of er genoeg schijfruimte beschikbaar is, en in de Voorkeuren waar het bestand bewaard moet worden";

/* As in generating thumbnails */
"Generating:" = "Maken:";

/* No comment provided by engineer. */
"Go to Download Page" = "Ga naar de Downloadpagina";

/* No comment provided by engineer. */
"Juicing:" = "Persen:";

/* When registration number check fails */
"License number is not valid!" = "Licentienummer is niet geldig!";

/* No comment provided by engineer. */
"No information about a new version is available!" = "Er is geen informatie over een nieuwe versie beschikbaar!";

/* No comment provided by engineer. */
"OK" = "OK";

/* skip generating thumbnails */
"Skip" = "Sla over";

/* No comment provided by engineer. */
"Stop" = "Stop";

/* When registration succeeded */
"Thank You" = "Thank You";
"Thank You!\nPortable Version Registered" = "Bedankt!!\nPortable-versie geregistreerd";

/* As in generating thumbnails */
"thumbnails" = "symbolen";

/* Of File Juicer */
"You have the newest version!" = "U heeft de nieuwste versie!";

/* For File Juicer */
"Paid..." = "Betaald…";

/* For the image in the main window (I'll put it in a pdf later) */
"Drag files here" = "Sleep bestanden naar hier";

/* For flash card juicing */
"No Flash Cards/Disks Found!" = "Geen Flashkaarten/-schijven gevonden!";

/* When registration code or name does not match */
"RegistrationFailed" = "De registratie-informatie die u ingevuld heeft is niet geldig. Controleer a.u.b. dat u \"Geregistreerd aan\" en \"Registratienummer\" precies ingevoerd heeft zoals ze in uw registratie-informatie staan.";

/* The menu item */
"Registration..." = "Registratie…";

"Watermark Reminder" = "File Juicer is Shareware.\nHet programma werkt volledig, maar met herinneringen en watermerken tot u het geregistreerd hebt.";

"FileJuicer is fully functional for %i days to let you try before you buy, but with watermarks in some images.\n" = "File Juicer volledig werkend voor %i dagen zodat u het uit kunt proberen alvorens het te kopen, maar met watermerken in sommige afbeeldingen.\n";
"The FileJuicer trial period has expired. JPEG and GIF will still get extracted but with watermarks in some images.\n" = "De proefperiode van File Juicer is afgelopen. JPEG- en GIF-afbeeldingen worden nog geëxtraheerd, maar met watermerken in sommige afbeeldingen.\n";
/* When registration code or name does not match */
"Your entry is too long." = "De ingevoerde informatie is te lang.";

/* dropping files */
"File too large" = "Bestand is te groot";

/* If you want to convert WMV files you need a codec for QuickTime */
"If you want to convert WMV files you need a codec for QuickTime" = "Als u WMV-bestanden wilt converteren heeft u een codec nodigvoor QuickTime";

/* If you want to convert WMV files you need a codec for QuickTime */
"Get Codec" = "Vind Codec";

/* For the File Menu */
"iPod Thumbs" = "iPod Symbolen";
"iPod Photo Cache" = "iPod Photo Cache";
"JPEG Thumbs" = "JPEG Symbolen";
"64 x 64 Thumbs" = "64 × 64 Symbolen";
"32 x 32 Thumbs" = "32 × 32 Symbolen";
"iPhone and iPod Touch Backups" = "iPhone and iPod Touch Backups";
"iTunes Album Artwork Cache" = "iTunes Album Artwork Cache";
/* Generating Index files */
"Index" = "Index";